---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings
source: html/60f49706-88f3-d2fb-0732-b1536c6e2e82.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNamingSchemeSettings

This class represents a circuit naming scheme settings in Autodesk Revit.

## Syntax (C#)
```csharp
public class CircuitNamingSchemeSettings : Element
```